app/controllers/members_controller.rb

SELECT `members`.* FROM `members` ORDER BY `members`.`grade` DESC, `members`.`firstname` ASC
---
	def index
		mem = Member.order(grade: :desc, firstname: :asc).all

SELECT  `members`.* FROM `members` WHERE `members`.`id` = 27 LIMIT 1
---
	def show
		@mem = Member.find(params[:id])