app/controllers/stats/stats_controller.rb

SELECT `runs`.* FROM `runs` WHERE (distance != 0 AND duration != 0)
SELECT COUNT(*) FROM `runs` WHERE (`runs`.`distance` != 0.0)
SELECT COUNT(*) FROM `runs` WHERE (`runs`.`duration` != 0)
---
	def index
		dist = 0
		dur = 0
		runs = Run.all
		runs.each do |r|
			dist += r.distance
			dur += r.duration
		end
		dist = dist.round 2
		@dist_avg = dist / Run.where.not(distance: 0).count
		@dur_avg = dur / Run.where.not(duration: 0).count / 60.0

SELECT `runs`.* FROM `runs` WHERE `runs`.`date` = '2017-07-12' ORDER BY `runs`.`days_late` ASC
---
	def logarun
		@days = []
		(1..5).each do |ago|
			@days[ago - 1] = Run.where(date: Date.today - ago).order(:days_late)